In [5]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\samyam\desktop\vrit-datascience\venv\lib\site-packages (from pandas) (2.1.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\samyam\desktop\vrit-datascience\venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\samyam\desktop\vrit-datascience\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---------- ----------------------------- 2.9/11.5 MB 21.0 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 47.8 MB/s eta 0:00:00
Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
Downloading tzdata-2024.2-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2024.2 tzdata-2024.2

In [6]:
import pandas as pd
import numpy as np

In [7]:
titanic_df = pd.read_csv("Titanic_data.csv", nrows=100)

## DataFrame Exploration

In [8]:
titanic_df.shape

(100, 12)

In [9]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  100 non-null    int64
 1   Survived     100 non-null    int64
 2   Pclass       100 non-null    int64
 3   Name         100 non-null    object
 4   Sex          100 non-null    object
 5   Age          78 non-null     float64
 6   SibSp        100 non-null    int64
 7   Parch        100 non-null    int64
 8   Ticket       100 non-null    object
 9   Fare         100 non-null    float64
 10  Cabin        20 non-null     object
 11  Embarked     99 non-null     object
dtypes: float64(2), int64(5), object(5)
memory usage: 9.5+ KB

In [12]:
titanic_df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## Specific Information

In [13]:
age = titanic_df['Age']
age

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
      ...
95     NaN
96    71.0
97    23.0
98    34.0
99    34.0
Name: Age, Length: 100, dtype: float64

* Average Age is 27 which suggests most of the passengers are young adults.
* Mean and Median are nearly equal suggesting a symmetrical distribution

In [14]:
print(age.min())
print(age.max())
print(age.mean())

0.83
71.0
27.46576923076923

**data_frame.describe()**

In [15]:
titanic_df['Age'].describe()

count    78.000000
mean     27.465769
std      15.278878
min       0.830000
25%      18.250000
50%      26.000000
75%      34.750000
max      71.000000
Name: Age, dtype: float64

In [16]:
titanic_df[['Age', 'Fare']].describe()

             Age        Fare
count  78.000000  100.000000
mean   27.465769   29.517625
std    15.278878   40.972905
min     0.830000    7.225000
25%    18.250000    8.050000
50%    26.000000   15.675000
75%    34.750000   32.134375
max    71.000000  263.000000

In [17]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,100.000000,100.000000,100.000000,78.000000,100.000000,100.000000,100.000000
mean,50.500000,0.410000,2.400000,27.465769,0.730000,0.440000,29.517625
std,29.011492,0.494311,0.816497,15.278878,1.179411,0.967346,40.972905
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,7.225000
25%,25.750000,0.000000,2.000000,18.250000,0.000000,0.000000,8.050000
50%,50.500000,0.000000,3.000000,26.000000,0.000000,0.000000,15.675000
75%,75.250000,1.000000,3.000000,34.750000,1.000000,0.000000,32.134375
max,100.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

**data_frame.value_counts()**

In [18]:
tdf = pd.read_csv("Titanic_data.csv")

In [19]:
tdf.value_counts("Sex")

Sex
male      577
female    314
Name: count, dtype: int64

In [20]:
#Percentage
tdf.value_counts("Sex", normalize = True)

Sex
male      0.647587
female    0.352413
Name: proportion, dtype: float64

In [21]:
tdf.value_counts("Survived")

Survived
0    549
1    342
Name: count, dtype: int64

In [22]:
tdf.value_counts("Survived", normalize=True)

Survived
0    0.616162
1    0.383838
Name: proportion, dtype: float64

In [23]:
tdf.value_counts([(tdf.Sex == "male") & (tdf.Survived == 1)])

False    782
True     109
Name: count, dtype: int64

In [24]:
tdf.value_counts([(tdf.Sex == "male") & (tdf.Survived == 1)], normalize=True)

False    0.877666
True     0.122334
Name: proportion, dtype: float64

In [25]:
tdf[tdf.Sex == "male"].value_counts('Survived', normalize=True)

Survived
0    0.811092
1    0.188908
Name: proportion, dtype: float64

In [26]:
tdf.value_counts(["Sex", "Survived"], normalize=True)

Sex     Survived
male    0           0.525253
female  1           0.261504
male    1           0.122334
female  0           0.090909
Name: proportion, dtype: float64

In [27]:
tdf.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [28]:
tdf.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [29]:
tdf.Sex.unique()

array(['male', 'female'], dtype=object)

**data_frame.group_by(by = ?)**

In [31]:
group_by_sex = tdf[["Sex", "Fare"]].groupby(by = "Sex")
group_by_sex

In [32]:
group_by_sex.mean()

             Fare
Sex
female  44.479818
male    25.523893

In [37]:
group_by_embarked = tdf[["Embarked", "Age", "Fare"]].groupby(by = "Embarked")
group_by_embarked.mean()

                Age       Fare
Embarked
C         30.814769  59.954144
Q         28.089286  13.276030
S         29.445397  27.079812

* Average age of passengers is near 30 from all locations
* The fare is higher in C suggesting more higher class passengers are boarding from there

In [38]:
tdf[["Age", "Fare"]].corr()

           Age      Fare
Age   1.000000  0.096067
Fare  0.096067  1.000000

In [44]:
group_by_survived = tdf[["Survived", "Age"]].groupby(by = "Survived")
group_by_survived.mean()

                Age
Survived
0         30.626179
1         28.343690

In [45]:
group_by_survived = tdf[["Survived", "Pclass"]].groupby(by = "Survived")
group_by_survived.mean()

            Pclass
Survived
0         2.531876
1         1.950292

**sample()**

In [47]:
tdf.sample(n = 50, random_state= 99)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
247,248,1,2,"Hamalainen, Mrs. William (Anna)",female,24.00,0,2,250649,14.5000,NaN,S
823,824,1,3,"Moor, Mrs. (Beila)",female,27.00,0,1,392096,12.4750,E121,S
566,567,0,3,"Stoytcheff, Mr. Ilia",male,19.00,0,0,349205,7.8958,NaN,S
666,667,0,2,"Butler, Mr. Reginald Fenton",male,25.00,0,0,234686,13.0000,NaN,S
199,200,0,2,"Yrois, Miss. Henriette (""Mrs Harbeck"")",female,24.00,0,0,248747,13.0000,NaN,S
480,481,0,3,"Goodwin, Master. Harold Victor",male,9.00,5,2,CA 2144,46.9000,NaN,S
86,87,0,3,"Ford, Mr. William Neal",male,16.00,1,3,W./C. 6608,34.3750,NaN,S
136,137,1,1,"Newsom, Miss. Helen Monypeny",female,19.00,0,2,11752,26.2833,D47,S
253,254,0,3,"Lobb, Mr. William Arthur",male,30.00,1,0,A/5. 3336,16.1000,NaN,S
809,810,1,1,"Chambers, Mrs. Norman Campbell (Bertha Griggs)",female,33.00,1,0,113806,53.1000,E8,S
208,209,1,3,"Carr, Miss. Helen ""Ellen""",female,16.00,0,0,367231,7.7500,NaN,Q
551,552,0,2,"Sharp, Mr. Percival James R",male,27.00,0,0,244358,26.0000,NaN,S
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
654,655,0,3,"Hegarty, Miss. Hanora ""Nora""",female,18.00,0,0,365226,6.7500,NaN,Q
48,49,0,3,"Samaan, Mr. Youssef",male,NaN,2,0,2662,21.6792,NaN,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00,1,0,113803,53.1000,C123,S
453,454,1,1,"Goldenberg, Mr. Samuel L",male,49.00,1,0,17453,89.1042,C92,C
84,85,1,2,"Ilett, Miss. Bertha",female,17.00,0,0,SO/C 14885,10.5000,NaN,S
514,515,0,3,"Coleff, Mr. Satio",male,24.00,0,0,349209,7.4958,NaN,S
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0000,NaN,S
326,327,0,3,"Nysveen, Mr. Johan Hansen",male,61.00,0,0,345364,6.2375,NaN,S
501,502,0,3,"Canavan, Miss. Mary",female,21.00,0,0,364846,7.7500,NaN,Q
50,51,0,3,"Panula, Master. Juha Niilo",male,7.00,4,1,3101295,39.6875,NaN,S
134,135,0,2,"Sobey, Mr. Samuel James Hayden",male,25.00,0,0,C.A. 29178,13.0000,NaN,S
813,814,0,3,"Andersson, Miss. Ebba Iris Alfrida",female,6.00,4,2,347082,31.2750,NaN,S
100,101,0,3,"Petranec, Miss. Matilda",female,28.00,0,0,349245,7.8958,NaN,S
267,268,1,3,"Persson, Mr. Ernst Ulrik",male,25.00,1,0,347083,7.7750,NaN,S
511,512,0,3,"Webber, Mr. James",male,NaN,0,0,SOTON/OQ 3101316,8.0500,NaN,S
608,609,1,2,"Laroche, Mrs. Joseph (Juliette Marie Louise La...",female,22.00,1,2,SC/Paris 2123,41.5792,NaN,C
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.00,1,0,SC/PARIS 2149,13.8583,NaN,C
272,273,1,2,"Mellinger, Mrs. (Elizabeth Anne Maidment)",female,41.00,0,1,250644,19.5000,NaN,S
843,844,0,3,"Lemberopolous, Mr. Peter L",male,34.50,0,0,2683,6.4375,NaN,C
506,507,1,2,"Quick, Mrs. Frederick Charles (Jane Richards)",female,33.00,0,2,26360,26.0000,NaN,S
230,231,1,1,"Harris, Mrs. Henry Birkhardt (Irene Wallach)",female,35.00,1,0,36973,83.4750,C83,S
288,289,1,2,"Hosono, Mr. Masabumi",male,42.00,0,0,237798,13.0000,NaN,S
502,503,0,3,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,330909,7.6292,NaN,Q
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.00,0,1,PC 17755,512.3292,B51 B53 B55,C
152,153,0,3,"Meo, Mr. Alfonzo",male,55.50,0,0,A.5. 11206,8.0500,NaN,S
465,466,0,3,"Goncalves, Mr. Manuel Estanslas",male,38.00,0,0,SOTON/O.Q. 3101306,7.0500,NaN,S
646,647,0,3,"Cor, Mr. Liudevit",male,19.00,0,0,349231,7.8958,NaN,S
81,82,1,3,"Sheerlinck, Mr. Jan Baptist",male,29.00,0,0,345779,9.5000,NaN,S
177,178,0,1,"Isham, Miss. Ann Elizabeth",female,50.00,0,0,PC 17595,28.7125,C49,C
131,132,0,3,"Coelho, Mr. Domingos Fernandeo",male,20.00,0,0,SOTON/O.Q. 3101307,7.0500,NaN,S
269,270,1,1,"Bissette, Miss. Amelia",female,35.00,0,0,PC 17760,135.6333,C99,S
74,75,1,3,"Bing, Mr. Lee",male,32.00,0,0,1601,56.4958,NaN,S
753,754,0,3,"Jonkoff, Mr. Lalio",male,23.00,0,0,349204,7.8958,NaN,S
321,322,0,3,"Danoff, Mr. Yoto",male,27.00,0,0,349219,7.8958,NaN,S
585,586,1,1,"Taussig, Miss. Ruth",female,18.00,0,2,110413,79.6500,E68,S
46,47,0,3,"Lennon, Mr. Denis",male,NaN,1,0,370371,15.5000,NaN,Q
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.00,1,0,7546,9.4750,NaN,S